tap "derailed/k9s"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "kubernetes-cli"
brew "kubectx"
brew "lsd"
brew "neovim"
brew "node"
brew "nvm"
brew "pipx"
brew "pnpm"
brew "pre-commit"
brew "ruff"
brew "rust"
brew "spaceship"
brew "thefuck"
brew "tmux"
brew "wget"
brew "zsh-syntax-highlighting"
brew "derailed/k9s/k9s"

cask "iterm2"
cask "1password"
cask "1password-cli"
cask "firefox"
cask "alfred"
cask "font-hack-nerd-font"
cask "docker"
cask "visual-studio-code@insiders"

vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
